Revit 2026 API

# PointLoadCreate(Document, ElementId, XYZ, XYZ, XYZ, PointLoadType) Method

---

Creates a new custom hosted point load within the project using data at point.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static PointLoad Create(
	Document document,
	ElementId hostElemId,
	XYZ point,
	XYZ forceVector,
	XYZ momentVector,
	PointLoadType symbol
)
```
```vb
Public Shared Function Create (
	document As Document,
	hostElemId As ElementId,
	point As XYZ,
	forceVector As XYZ,
	momentVector As XYZ,
	symbol As PointLoadType
) As PointLoad
```
```cpp
public:
static PointLoad^ Create(
	Document^ document,
	ElementId^ hostElemId,
	XYZ^ point,
	XYZ^ forceVector,
	XYZ^ momentVector,
	PointLoadType^ symbol
)
```
```fsharp
static member Create :
        document : Document *
        hostElemId : ElementId *
        point : XYZ *
        forceVector : XYZ *
        momentVector : XYZ *
        symbol : PointLoadType -> PointLoad
```

#### Parameters

document Document
     Document to which new point load will be added.
hostElemId ElementId
     The AnalyticalElement host element for the point Load.
point XYZ
     The position of point load, measured in decimal feet.
forceVector XYZ
     The applied 3d force vector.
momentVector XYZ
     The applied 3d moment vector.
symbol PointLoadType
     The symbol of the PointLoad. Set  to use default type.

#### Return Value

PointLoad If successful, returns the newly created PointLoad,  otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentException | hostElemId is not permitted for this type of load. -or- Thrown when work plane is not valid. |
| ArgumentNullException | A non-optional argument was null |
| ArgumentsInconsistentException | Thrown when force and moment vectors are equal zero. |
| InvalidOperationException | Thrown if type could not be set for newly created point load. |

#### Reference

PointLoad Class

Create Overload

Autodesk.Revit.DB.Structure Namespace